# Milestone 3

In [2]:
from scripts import FunctionScript
df = FunctionScript.LoadnClean('G:\\COSC301\\project\\group07-Project\\data\\raw\\defaultofcreditcardclients.csv')
df.head()

,Sex,Education,Marital Status,Age,Credit Limit,Payment Score,Avg Outstanding,Avg Paid,Default
0,F,BSc,Married,24,20000,0.666667,1284.000000,114.833333,True
1,F,BSc,Single,26,120000,1.500000,2846.166667,833.333333,True
2,F,BSc,Single,34,90000,1.000000,16942.166667,1836.333333,False
3,F,BSc,Married,37,50000,1.000000,38555.666667,1398.000000,False
4,M,BSc,Married,57,50000,0.666667,18223.166667,9841.500000,False

## Task 1
 As a group we reviewed the feedback and acted upon it accordingly. We decided to redo Milestone 2 since our grade was far below our standards and expectations. As such, the entire repo is now updated.

## Task 3

The data used in previous milestones was functional and processed well enough for the tableau exploration. Therefore, a new csv is made following the same pipeline.

In [4]:
df.to_csv(r'G:\\COSC301\\project\\group07-Project\\data\\processed\\JustinTableau.csv')

## Task 2 and 4 were done via Github and Tableau collectively.